{
  "MainContent": {
    "devTitle": "Fullstack Developer",
    "paragraph": "Hello, my name is Nivaldo Dantas — a full-stack developer, graduated in Software Engineering — with a strong academic foundation and practical experience in developing mobile and web applications.",
    "educationTitle": "Education",
    "degreeTitle": "Bachelor in Software Engineering",
    "degreeSubtitle": "Federal Institute of Amazonas - IFAM",
    "degreeYear": "Jan. 2020 - Jan. 2025",
    "continuedTitle": "Continued Education",
    "continuedSubtitle": "Aranouá Project - Federal Institute of Amazonas",
    "continuedYear": "Jan. 2021 - Dec. 2023",
    "continuedDesc": "Extracurricular activity in partnership between IFAM and Samsung to train, improve, and update students, ensuring constant modernization of skills and knowledge with a focus on performance, including courses in React, React Native, Mobile Programming, Databases, and real projects.",
    "experienceTitle": "Experience",
    "internTitle": "Intern",
    "internSubtitle": "Amazonas State Court of Accounts - TCE/AM",
    "internYear": "Jan. 2024 - May. 2025",
    "internDesc1": "Development of an informative web application about IT governance, using technologies such as React, NestJS, TypeScript, SQLite, Docker and Prisma, which enabled the sector to receive forms from its supervisees.",
    "internDesc2": "Development of questionnaires for annual evaluation of the General Data Protection Law (LGPD) using the LimeSurvey platform, with JavaScript scripts, which enabled data collection from 70% of the state agencies in Amazonas.",
    "internDesc3": "Implementation of automations to optimize workflows and reduce manual tasks, using scripts with Python language, through the Selenium library, automating repetitive processes carried out on the main TCE/AM portals.",
    "internDesc4": "Use of Kanban tools for organization, through the Trello website, enhancing task tracking and prioritization, furthermore, weekly meetings were held for brainstorming and requirements planning.",
    "languagesTitle": "Languages",
    "portuguese": "Portuguese",
    "portugueseLevel": "Native",
    "english": "English",
    "englishLevel": "Advanced (C1)"
  },
  "Footer": {
    "footer": "© 2025 Nivaldo Dantas. All rights reserved."
  },
  "Projects": {
    "search": "Search Projects by name, description and more!",
    "repoLoading": "Loading Repositories...",
    "repoError": "Error loading repositories. Please try again later."
  }
}
